Revit 2024 API
ContinuousRailType.Projection Property
 The horizontal distance between the outer boundary of the rail and the path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Projection { get; }
Visual Basic
Public ReadOnly Property Projection As Double
	Get
Visual C++
public:
property double Projection {
	double get ();
}
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace